test/classes_cc_0.plantuml
@startuml classes_cc_0
Local  <|--  Display
Local  *--  DisplayFactory
Recordable  <|--  Display
Recordable  *--  DisplayFactory
@enduml
